10/data/attachments/b69cdc01b282b91f.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_9ea7829f-6e42-42c6-bed8-bc3abca5e30d</nif:username>
            <nif:friendToBeAdded>Joann_never_Friend_67060_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>